Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: ليعلم أن قد أبلغوا رسالات ربهم وأحاط بما لديهم وأحصى كل شيء عددا
en: "That He may know that they have (truly) brought and delivered the Messages of their Lord: and He surrounds (all the mysteries) that are with them, and takes account of every single thing."

source: يا أيها المزمل
en: O thou folded in garments!

source: قم الليل إلا قليلا
en: Stand (to prayer) by night, but not all night,-

source: نصفه أو انقص منه قليلا
en: Half of it,- or a little less,

source: أو زد عليه ورتل القرآن ترتيلا
en: Or a little more; and recite the Qur'an in slow, measured rhythmic tones.

source: إنا سنلقي عليك قولا ثقيلا
en: Soon shall We send down to thee a weighty Message.

source: إن ناشئة الليل هي أشد وطئا وأقوم قيلا
en: Truly the rising by night is most potent for governing (the soul), and most suitable for (framing) the Word (of Prayer and Praise).

source: إن لك في النهار سبحا طويلا
en: True, there is for thee by day prolonged occupation with ordinary duties:

source: واذكر اسم ربك وتبتل إليه تبتيلا
en: But keep in remembrance the name of thy Lord and devote thyself to Him whole-heartedly.

source: رب المشرق والمغرب لا إله إلا هو فاتخذه وكيلا
en: (He is) Lord of the East and the West: there is no god but He: take Him therefore for (thy) Disposer of Affairs.

source: واصبر على ما يقولون واهجرهم هجرا جميلا
en: And have patience with what they say, and leave them with noble (dignity).

source: وذرني والمكذبين أولي النعمة ومهلهم قليلا
en: And leave Me (alone to deal with) those in possession of the good things of life, who (yet) deny the Truth; and bear with them for a little while.

source: إن لدينا أنكالا وجحيما
en: With Us are Fetters (to bind them), and a Fire (to burn them),

source: وطعاما ذا غصة وعذابا أليما
en: And a Food that chokes, and a Penalty Grievous.

source: يوم ترجف الأرض والجبال وكانت الجبال كثيبا مهيلا
en: One Day the earth and the mountains will be in violent commotion. And the mountains will be as a heap of sand poured out and flowing down.

source: إنا أرسلنا إليكم رسولا شاهدا عليكم كما أرسلنا إلى فرعون رسولا
en: We have sent to you, (O men!) a messenger, to be a witness concerning you, even as We sent a messenger to Pharaoh.

source: فعصى فرعون الرسول فأخذناه أخذا وبيلا
en: But Pharaoh disobeyed the messenger; so We seized him with a heavy Punishment.

source: فكيف تتقون إن كفرتم يوما يجعل الولدان شيبا
en: Then how shall ye, if ye deny (Allah), guard yourselves against a Day that will make children hoary-headed?-

source: السماء منفطر به كان وعده مفعولا
en: Whereon the sky will be cleft asunder? His Promise needs must be accomplished.

source: إن هذه تذكرة فمن شاء اتخذ إلى ربه سبيلا
en: Verily this is an Admonition: therefore, whoso will, let him take a (straight) path to his Lord!

source: إن ربك يعلم أنك تقوم أدنى من ثلثي الليل ونصفه وثلثه وطائفة من الذين معك والله يقدر الليل والنهار علم أن لن تحصوه فتاب عليكم فاقرءوا ما تيسر من القرآن علم أن سيكون منكم مرضى وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله فاقرءوا ما تيسر منه وأقيموا الصلاة وآتوا الزكاة وأقرضوا الله قرضا حسنا وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيرا وأعظم أجرا واستغفروا الله إن الله غفور رحيم
en: Thy Lord doth know that thou standest forth (to prayer) nigh two-thirds of the night, or half the night, or a third of the night, and so doth a party of those with thee. But Allah doth appoint night and day in due measure He knoweth that ye are unable to keep count thereof. So He hath turned to you (in mercy): read ye, therefore, of the Qur'an as much as may be easy for you. He knoweth that there may be (some) among you in ill-health; others travelling through the land, seeking of Allah's bounty; yet others fighting in Allah's Cause, read ye, therefore, as much of the Qur'an as may be easy (for you); and establish regular Prayer and give regular Charity; and loan to Allah a Beautiful Loan. And whatever good ye send forth for your souls ye shall find it in Allah's Presence,- yea, better and greater, in Reward and seek ye the Grace of Allah: for Allah is Oft-Forgiving, Most Merciful.

source: يا أيها المدثر
en: O thou wrapped up (in the mantle)!

source: قم فأنذر
en: Arise and deliver thy warning!

source: وربك فكبر
en: And thy Lord do thou magnify!

source: وثيابك فطهر
en: And thy garments keep free from stain!

source: والرجز فاهجر
en: And all abomination shun!

source: ولا تمنن تستكثر
en: Nor expect, in giving, any increase (for thyself)!

source: ولربك فاصبر
en: But, for thy Lord's (Cause), be patient and constant!

source: فإذا نقر في الناقور
en: Finally, when the Trumpet is sounded,

source: فذلك يومئذ يوم عسير
en: That will be- that Day - a Day of Distress,-

source: على الكافرين غير يسير
en: Far from easy for those without Faith.

source: ذرني ومن خلقت وحيدا
en: Leave Me alone, (to deal) with the (creature) whom I created (bare and) alone!-

source: وجعلت له مالا ممدودا
en: To whom I granted resources in abundance,

source: وبنين شهودا
en: And sons to be by his side!-

source: ومهدت له تمهيدا
en: To whom I made (life) smooth and comfortable!

source: ثم يطمع أن أزيد
en: Yet is he greedy-that I should add (yet more);-

source: كلا إنه كان لآياتنا عنيدا
en: By no means! For to Our Signs he has been refractory!

source: سأرهقه صعودا
en: Soon will I visit him with a mount of calamities!

source: إنه فكر وقدر
en: For he thought and he plotted;-

source: فقتل كيف قدر
en: And woe to him! How he plotted!-

source: ثم قتل كيف قدر
en: Yea, Woe to him; How he plotted!-

source: ثم نظر
en: Then he looked round;

source: ثم عبس وبسر
en: Then he frowned and he scowled;

source: ثم أدبر واستكبر
en: Then he turned back and was haughty;

source: فقال إن هذا إلا سحر يؤثر
en: Then said he: "This is nothing but magic, derived from of old;

source: إن هذا إلا قول البشر
en: "This is nothing but the word of a mortal!"

source: سأصليه سقر
en: Soon will I cast him into Hell-Fire!

source: وما أدراك ما سقر
en: And what will explain to thee what Hell-Fire is?

source: لا تبقي ولا تذر
en: Naught doth it permit to endure, and naught doth it leave alone!-

source: لواحة للبشر
en: Darkening and changing the colour of man!

source: عليها تسعة عشر
en: Over it are Nineteen.

source: وما جعلنا أصحاب النار إلا ملائكة وما جعلنا عدتهم إلا فتنة للذين كفروا ليستيقن الذين أوتوا الكتاب ويزداد الذين آمنوا إيمانا ولا يرتاب الذين أوتوا الكتاب والمؤمنون وليقول الذين في قلوبهم مرض والكافرون ماذا أراد الله بهذا مثلا كذلك يضل الله من يشاء ويهدي من يشاء وما يعلم جنود ربك إلا هو وما هي إلا ذكرى للبشر
en: And We have set none but angels as Guardians of the Fire; and We have fixed their number only as a trial for Unbelievers,- in order that the People of the Book may arrive at certainty, and the Believers may increase in Faith,- and that no doubts may be left for the People of the Book and the Believers, and that those in whose hearts is a disease and the Unbelievers may say, "What symbol doth Allah intend by this?" Thus doth Allah leave to stray whom He pleaseth, and guide whom He pleaseth: and none can know the forces of thy Lord, except He and this is no other than a warning to mankind.

source: كلا والقمر
en: Nay, verily: By the Moon,

source: والليل إذ أدبر
en: And by the Night as it retreateth,

source: والصبح إذا أسفر
en: And by the Dawn as it shineth forth,-

source: إنها لإحدى الكبر
en: This is but one of the mighty (portents),

source: نذيرا للبشر
en: A warning to mankind,-

source: لمن شاء منكم أن يتقدم أو يتأخر
en: To any of you that chooses to press forward, or to follow behind;-

source: كل نفس بما كسبت رهينة
en: Every soul will be (held) in pledge for its deeds.

source: إلا أصحاب اليمين
en: Except the Companions of the Right Hand.

source: في جنات يتساءلون
en: (They will be) in Gardens (of Delight): they will question each other,

source: عن المجرمين
en: And (ask) of the Sinners:

source: ما سلككم في سقر
en: "What led you into Hell Fire?"

source: قالوا لم نك من المصلين
en: They will say: "We were not of those who prayed;

source: ولم نك نطعم المسكين
en: "Nor were we of those who fed the indigent;

source: وكنا نخوض مع الخائضين
en: "But we used to talk vanities with vain talkers;

source: وكنا نكذب بيوم الدين
en: "And we used to deny the Day of Judgment,

source: حتى أتانا اليقين
en: "Until there came to us (the Hour) that is certain."

source: فما تنفعهم شفاعة الشافعين
en: Then will no intercession of (any) intercessors profit them.

source: فما لهم عن التذكرة معرضين
en: Then what is the matter with them that they turn away from admonition?-

source: كأنهم حمر مستنفرة
en: As if they were affrighted asses,

source: فرت من قسورة
en: Fleeing from a lion!

source: بل يريد كل امرئ منهم أن يؤتى صحفا منشرة
en: Forsooth, each one of them wants to be given scrolls (of revelation) spread out!

source: كلا بل لا يخافون الآخرة
en: By no means! But they fear not the Hereafter,

source: كلا إنه تذكرة
en: Nay, this surely is an admonition:

source: فمن شاء ذكره
en: Let any who will, keep it in remembrance!

source: وما يذكرون إلا أن يشاء الله هو أهل التقوى وأهل المغفرة
en: But none will keep it in remembrance except as Allah wills: He is the Lord of Righteousness, and the Lord of Forgiveness.

source: لا أقسم بيوم القيامة
en: I do call to witness the Resurrection Day;

source: ولا أقسم بالنفس اللوامة
en: And I do call to witness the self-reproaching spirit: (Eschew Evil).

source: أيحسب الإنسان ألن نجمع عظامه
en: Does man think that We cannot assemble his bones?

source: بلى قادرين على أن نسوي بنانه
en: Nay, We are able to put together in perfect order the very tips of his fingers.

source: بل يريد الإنسان ليفجر أمامه
en: But man wishes to do wrong (even) in the time in front of him.

source: يسأل أيان يوم القيامة
en: He questions: "When is the Day of Resurrection?"

source: فإذا برق البصر
en: At length, when the sight is dazed,

source: وخسف القمر
en: And the moon is buried in darkness.

source: وجمع الشمس والقمر
en: And the sun and moon are joined together,-

source: يقول الإنسان يومئذ أين المفر
en: That Day will Man say: "Where is the refuge?"

source: كلا لا وزر
en: By no means! No place of safety!

source: إلى ربك يومئذ المستقر
en: Before thy Lord (alone), that Day will be the place of rest.

source: ينبأ الإنسان يومئذ بما قدم وأخر
en: That Day will Man be told (all) that he put forward, and all that he put back.

source: بل الإنسان على نفسه بصيرة
en: Nay, man will be evidence against himself,

source: ولو ألقى معاذيره
en: Even though he were to put up his excuses.

source: لا تحرك به لسانك لتعجل به
en: Move not thy tongue concerning the (Qur'an) to make haste therewith.

source: إن علينا جمعه وقرآنه
en: It is for Us to collect it and to promulgate it:

source: فإذا قرأناه فاتبع قرآنه
en: But when We have promulgated it, follow thou its recital (as promulgated):

source: ثم إن علينا بيانه
en: Nay more, it is for Us to explain it (and make it clear):

source: كلا بل تحبون العاجلة
en: Nay, (ye men!) but ye love the fleeting life,

source: وتذرون الآخرة
en: And leave alone the Hereafter.

source: وجوه يومئذ ناضرة
en: Some faces, that Day, will beam (in brightness and beauty);-

source: إلى ربها ناظرة
en: Looking towards their Lord;

source: ووجوه يومئذ باسرة
en: And some faces, that Day, will be sad and dismal,

source: تظن أن يفعل بها فاقرة
en: In the thought that some back-breaking calamity was about to be inflicted on them;

source: كلا إذا بلغت التراقي
en: Yea, when (the soul) reaches to the collar-bone (in its exit),

source: وقيل من راق
en: And there will be a cry, "Who is a magician (to restore him)?"

source: وظن أنه الفراق
en: And he will conclude that it was (the Time) of Parting;

source: والتفت الساق بالساق
en: And one leg will be joined with another:

source: إلى ربك يومئذ المساق
en: That Day the Drive will be (all) to thy Lord!

source: فلا صدق ولا صلى
en: So he gave nothing in charity, nor did he pray!-

source: ولكن كذب وتولى
en: But on the contrary, he rejected Truth and turned away!

source: ثم ذهب إلى أهله يتمطى
en: Then did he stalk to his family in full conceit!

source: أولى لك فأولى
en: Woe to thee, (O men!), yea, woe!

source: ثم أولى لك فأولى
en: Again, Woe to thee, (O men!), yea, woe!

source: أيحسب الإنسان أن يترك سدى
en: Does man think that he will be left uncontrolled, (without purpose)?

source: ألم يك نطفة من مني يمنى
en: Was he not a drop of sperm emitted (in lowly form)?

source: ثم كان علقة فخلق فسوى
en: Then did he become a leech-like clot; then did (Allah) make and fashion (him) in due proportion.

source: فجعل منه الزوجين الذكر والأنثى
en: And of him He made two sexes, male and female.

source: أليس ذلك بقادر على أن يحيي الموتى
en: Has not He, (the same), the power to give life to the dead?

source: هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا
en: Has there not been over Man a long period of Time, when he was nothing - (not even) mentioned?

source: إنا خلقنا الإنسان من نطفة أمشاج نبتليه فجعلناه سميعا بصيرا
en: Verily We created Man from a drop of mingled sperm, in order to try him: So We gave him (the gifts), of Hearing and Sight.

source: إنا هديناه السبيل إما شاكرا وإما كفورا
en: We showed him the Way: whether he be grateful or ungrateful (rests on his will).

source: إنا أعتدنا للكافرين سلاسل وأغلالا وسعيرا
en: For the Rejecters we have prepared chains, yokes, and a blazing Fire.

source: إن الأبرار يشربون من كأس كان مزاجها كافورا
en: As to the Righteous, they shall drink of a Cup (of Wine) mixed with Kafur,-

source: عينا يشرب بها عباد الله يفجرونها تفجيرا
en: A Fountain where the Devotees of Allah do drink, making it flow in unstinted abundance.

source: يوفون بالنذر ويخافون يوما كان شره مستطيرا
en: They perform (their) vows, and they fear a Day whose evil flies far and wide.

source: ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا
en: And they feed, for the love of Allah, the indigent, the orphan, and the captive,-

source: إنما نطعمكم لوجه الله لا نريد منكم جزاء ولا شكورا
en: (Saying),"We feed you for the sake of Allah alone: no reward do we desire from you, nor thanks.

source: إنا نخاف من ربنا يوما عبوسا قمطريرا
en: "We only fear a Day of distressful Wrath from the side of our Lord."

source: فوقاهم الله شر ذلك اليوم ولقاهم نضرة وسرورا
en: But Allah will deliver them from the evil of that Day, and will shed over them a Light of Beauty and (blissful) Joy.

source: وجزاهم بما صبروا جنة وحريرا
en: And because they were patient and constant, He will reward them with a Garden and (garments of) silk.

source: متكئين فيها على الأرائك لا يرون فيها شمسا ولا زمهريرا
en: Reclining in the (Garden) on raised thrones, they will see there neither the sun's (excessive heat) nor (the moon's) excessive cold.

source: ودانية عليهم ظلالها وذللت قطوفها تذليلا
en: And the shades of the (Garden) will come low over them, and the bunches (of fruit), there, will hang low in humility.

source: ويطاف عليهم بآنية من فضة وأكواب كانت قواريرا
en: And amongst them will be passed round vessels of silver and goblets of crystal,-

source: قوارير من فضة قدروها تقديرا
en: Crystal-clear, made of silver: they will determine the measure thereof (according to their wishes).

source: ويسقون فيها كأسا كان مزاجها زنجبيلا
en: And they will be given to drink there of a Cup (of Wine) mixed with Zanjabil,-

source: عينا فيها تسمى سلسبيلا
en: A fountain there, called Salsabil.

source: ويطوف عليهم ولدان مخلدون إذا رأيتهم حسبتهم لؤلؤا منثورا
en: And round about them will (serve) youths of perpetual (freshness): If thou seest them, thou wouldst think them scattered Pearls.

source: وإذا رأيت ثم رأيت نعيما وملكا كبيرا
en: And when thou lookest, it is there thou wilt see a Bliss and a Realm Magnificent.

source: عاليهم ثياب سندس خضر وإستبرق وحلوا أساور من فضة وسقاهم ربهم شرابا طهورا
en: Upon them will be green Garments of fine silk and heavy brocade, and they will be adorned with Bracelets of silver; and their Lord will give to them to drink of a Wine Pure and Holy.

source: إن هذا كان لكم جزاء وكان سعيكم مشكورا
en: "Verily this is a Reward for you, and your Endeavour is accepted and recognised."

source: إنا نحن نزلنا عليك القرآن تنزيلا
en: It is We Who have sent down the Qur'an to thee by stages.

source: فاصبر لحكم ربك ولا تطع منهم آثما أو كفورا
en: Therefore be patient with constancy to the Command of thy Lord, and hearken not to the sinner or the ingrate among them.

source: واذكر اسم ربك بكرة وأصيلا
en: And celebrate the name of thy Lord morning and evening,

source: ومن الليل فاسجد له وسبحه ليلا طويلا
en: And part of the night, prostrate thyself to Him; and glorify Him a long night through.

source: إن هؤلاء يحبون العاجلة ويذرون وراءهم يوما ثقيلا
en: As to these, they love the fleeting life, and put away behind them a Day (that will be) hard.

source: نحن خلقناهم وشددنا أسرهم وإذا شئنا بدلنا أمثالهم تبديلا
en: It is We Who created them, and We have made their joints strong; but, when We will, We can substitute the like of them by a complete change.

source: وما تشاءون إلا أن يشاء الله إن الله كان عليما حكيما
en: But ye will not, except as Allah wills; for Allah is full of Knowledge and Wisdom.

source: يدخل من يشاء في رحمته والظالمين أعد لهم عذابا أليما
en: He will admit to His Mercy whom He will; But the wrong-doers,- for them has He prepared a grievous Penalty.

source: والمرسلات عرفا
en: By the (Winds) sent forth one after another (to man's profit);

source: فالعاصفات عصفا
en: Which then blow violently in tempestuous Gusts,

source: والناشرات نشرا
en: And scatter (things) far and wide;

source: فالفارقات فرقا
en: Then separate them, one from another,

source: فالملقيات ذكرا
en: Then spread abroad a Message,

source: عذرا أو نذرا
en: Whether of Justification or of Warning;-

source: إنما توعدون لواقع
en: Assuredly, what ye are promised must come to pass.

source: فإذا النجوم طمست
en: Then when the stars become dim;

source: وإذا السماء فرجت
en: When the heaven is cleft asunder;

source: وإذا الجبال نسفت
en: When the mountains are scattered (to the winds) as dust;

source: وإذا الرسل أقتت
en: And when the messengers are (all) appointed a time (to collect);-

source: لأي يوم أجلت
en: For what Day are these (portents) deferred?

source: ليوم الفصل
en: For the Day of Sorting out.

source: وما أدراك ما يوم الفصل
en: And what will explain to thee what is the Day of Sorting out?

source: ويل يومئذ للمكذبين
en: Ah woe, that Day, to the Rejecters of Truth!

source: ألم نهلك الأولين
en: Did We not destroy the men of old (for their evil)?

source: ثم نتبعهم الآخرين
en: So shall We make later (generations) follow them.

source: كذلك نفعل بالمجرمين
en: Thus do We deal with men of sin.

source: ألم نخلقكم من ماء مهين
en: Have We not created you from a fluid (held) despicable?-

source: فجعلناه في قرار مكين
en: The which We placed in a place of rest, firmly fixed,

source: إلى قدر معلوم
en: For a period (of gestation), determined (according to need)?

source: فقدرنا فنعم القادرون
en: For We do determine (according to need); for We are the best to determine (things).

source: ألم نجعل الأرض كفاتا
en: Have We not made the earth (as a place) to draw together.

source: أحياء وأمواتا
en: The living and the dead,

source: وجعلنا فيها رواسي شامخات وأسقيناكم ماء فراتا
en: And made therein mountains standing firm, lofty (in stature); and provided for you water sweet (and wholesome)?

source: انطلقوا إلى ما كنتم به تكذبون
en: (It will be said:) "Depart ye to that which ye used to reject as false!

source: انطلقوا إلى ظل ذي ثلاث شعب
en: "Depart ye to a Shadow (of smoke ascending) in three columns,

source: لا ظليل ولا يغني من اللهب
en: "(Which yields) no shade of coolness, and is of no use against the fierce Blaze.

source: إنها ترمي بشرر كالقصر
en: "Indeed it throws about sparks (huge) as Forts,

source: كأنه جمالت صفر
en: "As if there were (a string of) yellow camels (marching swiftly)."

source: هذا يوم لا ينطقون
en: That will be a Day when they shall not be able to speak.

source: ولا يؤذن لهم فيعتذرون
en: Nor will it be open to them to put forth pleas.

source: هذا يوم الفصل جمعناكم والأولين
en: That will be a Day of Sorting out! We shall gather you together and those before (you)!

source: فإن كان لكم كيد فكيدون
en: Now, if ye have a trick (or plot), use it against Me!

source: إن المتقين في ظلال وعيون
en: As to the Righteous, they shall be amidst (cool) shades and springs (of water).

source: وفواكه مما يشتهون
en: And (they shall have) fruits,- all they desire.

source: كلوا وتمتعوا قليلا إنكم مجرمون
en: (O ye unjust!) Eat ye and enjoy yourselves (but) a little while, for that ye are Sinners.

source: وإذا قيل لهم اركعوا لا يركعون
en: And when it is said to them, "Prostrate yourselves!" they do not so.

source: فبأي حديث بعده يؤمنون
en: Then what Message, after that, will they believe in?

source: عم يتساءلون
en: Concerning what are they disputing?

source: عن النبإ العظيم
en: Concerning the Great News,

source: الذي هم فيه مختلفون
en: About which they cannot agree.

source: كلا سيعلمون
en: Verily, they shall soon (come to) know!

source: ثم كلا سيعلمون
en: Verily, verily they shall soon (come to) know!

source: ألم نجعل الأرض مهادا
en: Have We not made the earth as a wide expanse,

source: والجبال أوتادا
en: And the mountains as pegs?

source: وخلقناكم أزواجا
en: And (have We not) created you in pairs,

source: وجعلنا نومكم سباتا
en: And made your sleep for rest,

source: وجعلنا الليل لباسا
en: And made the night as a covering,

source: وجعلنا النهار معاشا
en: And made the day as a means of subsistence?

source: وبنينا فوقكم سبعا شدادا
en: And (have We not) built over you the seven firmaments,

source: وجعلنا سراجا وهاجا
en: And placed (therein) a Light of Splendour?

source: وأنزلنا من المعصرات ماء ثجاجا
en: And do We not send down from the clouds water in abundance,

source: لنخرج به حبا ونباتا
en: That We may produce therewith corn and vegetables,

source: وجنات ألفافا
en: And gardens of luxurious growth?

source: إن يوم الفصل كان ميقاتا
en: Verily the Day of Sorting out is a thing appointed,

source: يوم ينفخ في الصور فتأتون أفواجا
en: The Day that the Trumpet shall be sounded, and ye shall come forth in crowds;

source: وفتحت السماء فكانت أبوابا
en: And the heavens shall be opened as if there were doors,

source: وسيرت الجبال فكانت سرابا
en: And the mountains shall vanish, as if they were a mirage.

source: إن جهنم كانت مرصادا
en: Truly Hell is as a place of ambush,

source: للطاغين مآبا
en: For the transgressors a place of destination:

source: لابثين فيها أحقابا
en: They will dwell therein for ages.

source: لا يذوقون فيها بردا ولا شرابا
en: Nothing cool shall they taste therein, nor any drink,

source: إلا حميما وغساقا
en: Save a boiling fluid and a fluid, dark, murky, intensely cold,

source: جزاء وفاقا
en: A fitting recompense (for them).

source: إنهم كانوا لا يرجون حسابا
en: For that they used not to fear any account (for their deeds),

source: وكذبوا بآياتنا كذابا
en: But they (impudently) treated Our Signs as false.

source: وكل شيء أحصيناه كتابا
en: And all things have We preserved on record.

source: فذوقوا فلن نزيدكم إلا عذابا
en: "So taste ye (the fruits of your deeds); for no increase shall We grant you, except in Punishment."

source: إن للمتقين مفازا
en: Verily for the Righteous there will be a fulfilment of (the heart's) desires;

source: حدائق وأعنابا
en: Gardens enclosed, and grapevines;

source: وكواعب أترابا
en: And voluptuous women of equal age;

source: وكأسا دهاقا
en: And a cup full (to the brim).

source: لا يسمعون فيها لغوا ولا كذابا
en: No vanity shall they hear therein, nor Untruth:-

source: جزاء من ربك عطاء حسابا
en: Recompense from thy Lord, a gift, (amply) sufficient,

source: رب السماوات والأرض وما بينهما الرحمن لا يملكون منه خطابا
en: (From) the Lord of the heavens and the earth, and all between, (Allah) Most Gracious: None shall have power to argue with Him.
